app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "'dolby'"], ["LIMIT", 1]]
---
  def self.find_by_credentials(loginCredentials, password)
    user = loginCredentials.include?('@') ? User.find_by(email: loginCredentials)
      : User.find_by(username: loginCredentials)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Tm4pQ7XOY5QvDVUuiGN5zg"], ["updated_at", "2020-01-29 00:19:14.751219"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = User.generate_session_token!
    self.save!